---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NothingToApplyError
source: html/c0abe9dd-fe2f-4f1b-ddff-68df7ee526f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NothingToApplyError Property

Start and end elevations are the same, nothing to Apply.

## Syntax (C#)
```csharp
public static FailureDefinitionId NothingToApplyError { get; }
```